mike_rowe/app/views/teachers/show.html.erb

<div class="group">
    <% @teacher.groups.where(date: @date).each do |group| %>
---
SELECT "groups".* FROM "groups" WHERE "groups"."teacher_id" = $1 AND "groups"."date" = $2  [["teacher_id", 1], ["date", "2016-01-26"]]