mike_rowe/app/controllers/sessions_controller.rb

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."email" = $1 LIMIT 1  [["email", "yoshiko_sanford@strosin.info"]]
---
def create
  teacher = Teacher.find_by_email(params[:email])