mike_rowe/app/controllers/students_controller.rb

SELECT "students".* FROM "students"
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    if Student.all.length > 0
      @student = Student.find(params[:id])