mike_rowe/app/controllers/teachers_controller.rb

SELECT "teachers".* FROM "teachers"
---
  def index
    @teachers = Teacher.all

SELECT "teachers".* FROM "teachers"
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    if Teacher.all.length > 0
      @teacher = Teacher.find(params[:teacher_id])